[
    {
        "terrain": "Coast",
        "folklore": [
            "It’s said the sea whispers secrets to those who listen at dawn.",
            "Finding a shell with a hole means a wish will soon come true.",
            "Leaving a coin in the tide is good luck for safe voyages.",
            "Sailors believe that seeing a white heron is a sign of calm seas ahead.",
            "Beware the siren’s song at night; it lures the unwary to the depths."
        ]
    },
    {
        "terrain": "Desert",
        "folklore": [
            "Desert winds carry the voices of ancient travelers lost in the sands.",
            "A sudden oasis appearing is a blessing from desert spirits.",
            "Avoid traveling alone at noon, or the sun spirits will steal your shadow.",
            "Finding a desert rose means protection from storms and mirages.",
            "It’s believed that sand dunes shift to hide the treasure of forgotten kings."
        ]
    },
    {
        "terrain": "Forest",
        "folklore": [
            "Whistling in the woods calls mischievous sprites to play tricks on you.",
            "A crow’s caw at twilight is a warning of approaching danger.",
            "If you leave a gift for the dryads, your path will be clear in the forest.",
            "Finding a circle of mushrooms is a gateway to the faerie realm.",
            "Never take wood from a fallen tree without thanking the forest."
        ]
    },
    {
        "terrain": "Jungle",
        "folklore": [
            "The jungle is alive with watching eyes; never speak ill of its creatures.",
            "A brightly colored butterfly means a spirit is nearby offering protection.",
            "If you hear drums at night, it’s the jungle’s heartbeat and should be respected.",
            "Carrying jungle vines as talismans protects against poison and curses.",
            "It is said the jungle spirits can change forms to test the worthiness of travelers."
        ]
    },
    {
        "terrain": "Hills",
        "folklore": [
            "Rolling thunder over the hills is the sound of giants playing their games.",
            "Finding a smooth, round stone on a hilltop brings strength and courage.",
            "Hills are homes to earth spirits who reward those who tread lightly.",
            "At dawn, the mist in the hills carries the voices of lost lovers.",
            "Singing to the hills is said to bring rain and good harvests."
        ]
    },
    {
        "terrain": "Mountains",
        "folklore": [
            "Mountains are the realm of ancient spirits that guard hidden knowledge.",
            "Echoes in the mountains are voices from the past offering guidance.",
            "Leaving an offering at a mountain shrine ensures safe passage.",
            "Seeing a hawk soaring high is a sign of honor and protection.",
            "It is said that the mountain winds can carry prayers to the gods."
        ]
    },
    {
        "terrain": "Plains",
        "folklore": [
            "A lone wolf howling on the plains signals a time of change.",
            "If wildflowers bloom out of season, the plains are blessed by the spirits.",
            "Sleeping under the stars on the plains invites dreams of prophecy.",
            "Carrying a blade of grass from the plains brings good fortune.",
            "The plains are said to be watched over by guardian horses that protect travelers."
        ]
    },
    {
        "terrain": "River",
        "folklore": [
            "Throwing a pebble into the river while making a wish is said to bring it true.",
            "Rivers are home to water spirits who reward respect with safe crossings.",
            "If the river runs red at dawn, a warning of danger is near.",
            "Carrying river stones wards off illness and bad luck.",
            "It is believed that river sprites can grant favors if treated kindly."
        ]
    },
    {
        "terrain": "Swamp",
        "folklore": [
            "Swamps are full of ancient magic; never disturb the moss-covered stones.",
            "A frog’s croak at dusk is believed to bring luck in love.",
            "If you see will-o’-the-wisps, follow them carefully to hidden treasures.",
            "Leaving bread crumbs in the swamp keeps the spirits from mischief.",
            "The mist in the swamp is said to carry voices of those lost long ago."
        ]
    },
    {
        "terrain": "Tundra",
        "folklore": [
            "The tundra winds carry stories of the old world and forgotten heroes.",
            "Finding a feather frozen in ice is a sign of blessing from the sky spirits.",
            "It is said that singing to the stars in the tundra brings peace to the soul.",
            "Beware stepping on cracks in the ice; they are gates to the spirit world.",
            "Snowflakes falling in a spiral mean a wish will soon be granted."
        ]
    },
    {
        "terrain": "Underground",
        "folklore": [
            "The tunnels below are alive with earth spirits who guide or mislead travelers.",
            "Dropping a coin in a cavern pool brings good luck and safe return.",
            "Stalactites are believed to be the teeth of ancient stone dragons.",
            "Whispering secrets to the underground winds keeps you safe from harm.",
            "Finding a glowing crystal is a sign of the deep magic beneath the earth."
        ]
    },
    {
        "terrain": "Urban",
        "folklore": [
            "It’s said the city’s shadows hide unseen watchers protecting the streets.",
            "Spilling salt outside your door invites bad luck; toss a pinch over your shoulder.",
            "Leaving bread out at midnight keeps the house safe from spirits.",
            "A black cat crossing your path is a sign of upcoming change.",
            "Carrying a coin from the city’s founding year brings prosperity."
        ]
    }
]