[
    {
        "magic": "Polar",
        "folklore": [
            "When the northern lights dance fiercely, it’s a sign the spirits are celebrating.",
            "Snow falling on a silent night means the ancestors are watching over the village.",
            "Never leave food out during the long winter night or the frost spirits will steal your warmth.",
            "If your breath freezes in the air, it’s a warning to speak only truth that day.",
            "Finding a piece of ice shaped like a heart is good luck for love in the coming season."
        ]
    },
    {
        "magic": "Temperate",
        "folklore": [
            "A robin singing at dawn means the forest is blessing the day.",
            "If a fox crosses your path three times, a secret is about to be revealed.",
            "Rain falling during a festival is believed to wash away old misfortune.",
            "Wearing a wreath of wildflowers keeps evil eyes from finding you.",
            "Breaking a twig in the woods is disrespectful to the tree spirits and brings bad luck."
        ]
    },
    {
        "magic": "Tropical",
        "folklore": [
            "The rustling of palm leaves at night is said to be the whispering of guardian spirits.",
            "If a sudden downpour begins during a celebration, it’s the gods’ way of joining in.",
            "Never cut a banana tree without asking permission from the forest spirits first.",
            "Brightly colored birds are messengers of good fortune and must never be harmed.",
            "Leaving a bowl of fresh water outside invites helpful water sprites into your home."
        ]
    },
    {
        "magic": "Dry",
        "folklore": [
            "Mirages are illusions created by desert spirits to protect their sacred places.",
            "Finding a feather in the sand means a wanderer’s blessing will follow you.",
            "Never whistle after sundown, or the desert winds will carry your voice away.",
            "Carrying a piece of obsidian protects against the sting of scorpions and bad luck.",
            "Cacti are said to house tiny, prickly guardians who punish those who harm them."
        ]
    },
    {
        "magic": "Continental",
        "folklore": [
            "Thunder rolling from the mountains means the giant gods are angry or pleased.",
            "If the first snow falls before the leaves have turned, expect a harsh winter.",
            "Finding a four-leaf clover near your home brings protection from storms.",
            "Hiding a small stone in your pocket keeps you safe during long travels.",
            "Birds flying low signal an approaching storm and warn the villagers to prepare."
        ]
    }
]