[
  {
    "None": [
      "Lantern Hands (Winter Solstice): A practical holiday where community lanterns are relit and tools blessed for another hard year.",
      "Maker’s March (Early Spring): Honoring inventors, farmers, and builders with public fairs and problem-solving games.",
      "Binding Oath Day (First Week of Summer): Contracts and deals are ceremonially renewed in front of elders and peers.",
      "Stone’s Faith (Late Autumn): A quiet holiday of gratitude, where people place hands on stone walls or hearths and whisper thanks.",
      "Dustwatch Day (End of Harvest): Communities gather to repair roads, sweep public squares, and finish the year’s chores together.",
      "Wordsend (Midwinter): Old books and letters are read aloud to preserve memory in the absence of magic."
    ]
  },
  {
    "Low": [
      "Wispwatch (First Fog of Autumn): Small lights are carried through town to honor ancestors who may visit in the mist.",
      "Charmkind Day (Spring Equinox): Artisans gift simple good luck charms made with thread, bone, or clay.",
      "Candlebind (New Moon in Winter): Families light handmade candles believed to ward off misfortune.",
      "Sootspell Day (End of Summer): Hearths are cleaned and minor warding symbols are drawn in soot around homes.",
      "Whisperwind (Early Spring): Messages are tied to kites or tossed on the breeze, hoping spirits carry them.",
      "Rainchant (First Thunderstorm): Light songs and chants are performed to welcome nourishing rain, thought to encourage better harvests."
    ]
  },
  {
    "Moderate": [
      "Glintswell (Spring Bloom): Magic wells and fountains are polished, and offerings are tossed in to keep magic flowing cleanly.",
      "Runefrost Eve (First Frost): Old runes are retraced on doors and hearths for winter protection.",
      "Lightleap Day (Summer Solstice): Mages display minor spells in synchronized dances of light and air.",
      "Sealweave Festival (Early Autumn): Local wizards reinforce magical protections on bridges, gates, and walls.",
      "Scrollwake (First Day of School Season): Young learners receive enchanted scrolls or trinkets from elders in good luck ceremonies.",
      "Dust of Ashes (Midwinter): Ash from fire spells is collected and painted into protective wards against sickness."
    ]
  },
  {
    "High": [
      "Arcflare Festival (Late Summer): Grand lightshows and illusions fill the sky in a celebration of magical artistry.",
      "Leydrift (Spring Equinox): Communities gather at leyline nexuses for group meditation and magical attunement.",
      "Wandbearers’ Day (First Full Moon of Summer): Mages pass down their first wand or focus to an apprentice.",
      "Etherwake (Autumn Equinox): Floating lanterns are lit with spark spells and sent into the sky or across rivers.",
      "Hexfold (First Week of Winter): Hexcrafters demonstrate complex spell-weaving competitions in public squares.",
      "Soulmark Day (Early Spring): People have temporary sigils drawn on their skin to represent their magical nature or aspirations."
    ]
  },
  {
    "Mythic": [
      "Veil’s Shatter (Twilight of the Longest Night): Celebrates the ancient moment when magic flooded the world. Massive rituals reenact the event.",
      "Eclipsewake (Every Solar Eclipse): Mythic-level wards are recast as celestial bodies align, said to keep reality intact.",
      "Myrrhchant (Midwinter): Rare spell ingredients are traded in silent reverence; thought to please primal arcane entities.",
      "Ascendant Flame (Midsummer): The flame of creation is symbolized with mythic fire, often conjured by archmages.",
      "Divination Day (Last Day of Year): Oracles from across the land give prophecies in one unified ritual; believed to shape fate itself.",
      "Eldersign Eve (Full Moon in Spring): Great magical constructs light up across the land, revealing ancient symbols said to predate time."
    ]
  }
]
