[
  {
    "terrain": "Coast",
    "holidays": [
      "Netmender's Rest (Late Winter): A day for repairing nets and honoring the hands that work the sea. Families gather in coastal sheds to share warm meals and stories.",
      "Stormwake Eve (Mid-Spring): Celebrated the evening before seasonal storms arrive. Bonfires are lit on beaches to ward off ill winds.",
      "Tideward Day (First High Tide of Summer): Sailors make offerings to tide shrines before departing for voyages.",
      "Shellfire Night (Late Summer): Children burn dried seaweed in lanterns shaped like fish and shell creatures.",
      "Seabound Oath (Autumn Equinox): New sailors take their first oaths under the setting sun, marking a rite of passage.",
      "Driftmoon Festival (Full Moon in Late Autumn): Driftwood sculptures are set afloat by moonlight to carry dreams to the deep."
    ]
  },
  {
    "terrain": "Desert",
    "holidays": [
      "Mirage Day (High Summer): Dancers perform under the heat mirage to symbolize illusions of hope and survival.",
      "Scorchsend (End of Dry Season): A ritual of shared water and silent gratitude for endurance.",
      "Duneguard Vigil (New Moon of Spring): Watchfires are kept all night to protect against spirits that roam when the dunes shift.",
      "Cactus Light (Mid-Spring Bloom): Lanterns are hung from blooming cacti in celebration of hidden beauty.",
      "Suntrail Festival (Summer Solstice): A barefoot walk on sun-warmed stone, followed by sand-painted blessings.",
      "Glasswind Day (First Windstorm of Autumn): Shards of desert glass are exchanged as tokens of protection."
    ]
  },
  {
    "terrain": "Forest",
    "holidays": [
      "Saprise (Early Spring): First sap is tapped, and tree totems are blessed for health and growth.",
      "Hollowdance (Mid-Autumn): Dancers wear carved wooden masks and spin among the trees at dusk.",
      "Fawnday (First Birth of Spring Wildlife): Quiet walks in hopes of glimpsing a fawn, followed by wreath offerings.",
      "Leafturn Vigil (First Red Leaf of Fall): Observers sit still in the woods to hear the ‘voice of change.’",
      "Bramblefire (Late Summer): Bramble thickets are trimmed and burned to protect paths and honor wild spirits.",
      "Rootward Day (Winter Solstice): People gather around large tree roots and whisper wishes into the soil."
    ]
  },
  {
    "terrain": "Jungle",
    "holidays": [
      "Mistbloom Festival (Early Wet Season): Glowing fruit is hung at entrances to guide jungle travelers.",
      "Vinebraid Day (End of Dry Season): Community braids vines into hanging banners to ward off creeping dangers.",
      "Underleaf Night (Mid-Summer): Observers walk beneath the canopy in silence, listening for ancestral voices.",
      "Raincall (First Rain of Season): Children beat drums on broad leaves to summon more rainfall.",
      "Canopy Chime (Longest Day of Year): Wind chimes are suspended in the treetops to invite sky spirits.",
      "Sporeveil (New Moon in Wet Season): Fungal caps are collected and arranged into glowing spirals to ward off disease."
    ]
  },
  {
    "terrain": "Hills",
    "holidays": [
      "Skyroll (Spring Equinox): Blankets are rolled down grassy slopes in celebration of movement and balance.",
      "Echofeast (Full Moon in Summer): Tables are set on hilltops and echoed calls signal the start of the meal.",
      "Windthread Day (Late Autumn): Ribbons are tied to posts on windy peaks and wishes are spoken aloud.",
      "Stonecradle (First Frost): Small cairns are built as symbols of endurance and peace.",
      "Hilltide Song (Summer Solstice): Groups chant harmonic songs on opposing hills to ‘stitch’ the valley.",
      "Lanterntrail (Early Winter): Lanterns are set along ancient footpaths to guide homeward walkers."
    ]
  },
  {
    "terrain": "Mountains",
    "holidays": [
      "Cragwatch (Late Summer): High ledges are manned with watchers who retell old warnings through song.",
      "Icebind Day (First Snow): Gloves and ropes are blessed for safety before the climbing season begins.",
      "Peakveil (New Moon in Spring): Mist nets are strung and spirits of the mountain are asked to show mercy.",
      "Torchreach (Winter Solstice): Fires are lit from base to peak to ward off darkness in all layers of the land.",
      "Echoforge (Autumn): Blacksmiths sing as they work, believing echoes hammer strength into their tools.",
      "Stonegrace (Spring Melt): Locals clean scree paths and leave offerings to prevent rockslides."
    ]
  },
  {
    "terrain": "Plains",
    "holidays": [
      "Prairiedust Day (Late Spring): Colored powders are thrown from horseback to mark the return of herds.",
      "Wheatwatch (Mid-Harvest): People watch the fields from dusk till dawn, protecting them with songs.",
      "Horizonfast (Winter Solstice): A day of quiet facing west, in reflection of the year's passing.",
      "Skythread (Spring Equinox): Tall poles are wrapped in streamers to ‘tie’ clouds to the earth.",
      "Fieldborn Day (First Sprouting): Seeds are cast into the wind and tiny effigies are planted in the soil.",
      "Stormmarch (Start of Rainy Season): Drums mimic thunder to march in rhythm with the coming storms."
    ]
  },
  {
    "terrain": "River",
    "holidays": [
      "Springflow Day (First Thaw): Tributaries are decorated with fresh flowers and water is tasted with reverence.",
      "Ferrydawn (Mid-Spring): Ferries run from dawn to dusk offering free passage in honor of journey spirits.",
      "Reedveil (Early Summer): Reeds are woven into masks to be worn during sunset river dances.",
      "Moonmirror (Full Moon in Summer): Floating silver bowls are set afloat, catching moonlight and reflecting wishes.",
      "Watersway (Autumn Equinox): A single boat travels the full stretch of the river, carrying family blessings.",
      "Riftlight Day (Midwinter): Cracks in frozen river ice are filled with glowmoss to honor the river’s sleeping face."
    ]
  },
  {
    "terrain": "Swamp",
    "holidays": [
      "Fogblessing (Late Autumn): Spirits are called by name in the fog, and gifts are left at the edge of pools.",
      "Toadwake Day (Spring Rain): First toads are honored with gentle drumming and shared tales.",
      "Willowchant (New Moon): Songs are whispered to weeping trees, asking for secrets of the deep water.",
      "Fenlight Vigil (Mid-Summer): Glowmoss is floated in baskets across the bogs to light lost souls' paths.",
      "Mirekind Day (Winter): Elders tell stories of ancient creatures who first walked the mud.",
      "Briarrest (End of Wet Season): Brambles are trimmed and burned while chants offer thanks for protection."
    ]
  },
  {
    "terrain": "Tundra",
    "holidays": [
      "Snowbreathe (First Windless Night): People stand silent outside to 'hear the breath of the land.'",
      "Longgleam (Full Moon in Midwinter): Ice crystals are collected and arranged to reflect moonlight in circles.",
      "Packshare Day (End of Deep Winter): Families gather and split food evenly, no matter wealth or standing.",
      "Rimeforge (Late Autumn): Tools are ritually struck against stone to awaken the sleeping heat of the earth.",
      "Shardtrail Festival (Spring): People create paths using shards of ice, lighting the way for travelers.",
      "Auroralace (Peak Aurora Season): Cloaks are embroidered beneath the lights to honor ancestors."
    ]
  },
  {
    "terrain": "Underground",
    "holidays": [
      "Glowrest (Midwinter): Phosphorescent minerals are arranged into glowing mosaics to calm restless spirits.",
      "Tunnelbeat Day (Spring): Drums are played at crossroads to ‘wake’ the passages from winter sleep.",
      "Rockpulse (Summer Solstice): Miners thump out heartbeats on cave walls to celebrate unity.",
      "Gemquiet (New Moon): No light or sound is permitted for one hour in deep caverns. Celebrated for introspection.",
      "Stonestep (First Snow Above): Surface is acknowledged by placing offerings in airshafts and chimneys.",
      "Veinlight Festival (Autumn): Gemstones are polished and worn as symbols of ancestral protection."
    ]
  },
  {
    "terrain": "Urban",
    "holidays": [
      "Founders' Ring (Early Spring): Circles are drawn in chalk around old plazas and stories retold within them.",
      "Cornermark Day (Summer Solstice): Each city block is adorned with colored banners to show unity.",
      "Bellnight (Late Autumn): Bells ring through the city at dusk to call peace among citizens.",
      "Keykeeper’s Vigil (Midwinter): People place symbolic keys at doorways in remembrance of trusted guardians.",
      "Skymarket Festival (High Summer): Rooftops host markets and performers in celebration of community heights.",
      "Gratestep Day (Autumn Equinox): Streets are swept clean and public steps are painted to honor open passage."
    ]
  }
]