[
  {
    "climate": "Polar",
    "holidays": [
      "Frostkin Day: Celebrated during the first major snowfall of winter, children wear white cloaks and pretend to be spirits of frost, knocking on doors to receive warm treats. Celebrated to welcome the winter spirits who are said to protect the young.",
      "Lantern Deep: A midwinter tradition, lanterns are lowered into deep snow wells or caverns to 'light the underworld.' Celebrated in reverence for ancestors believed to dwell beneath the ice.",
      "Wolfcall Night: Held on the longest night of the year, residents howl together from hilltops while feasting on dried meats around fires. Celebrated to honor the resilience and unity of the community, inspired by wolf packs.",
      "Icebind Week: Over seven days in late autumn, people clasp hands over frozen lakes and rivers and recite shared promises. Celebrated to bind friendships and alliances before winter’s isolation sets in.",
      "Starlace Day: Celebrated during the year's first blizzard, intricate snowflake patterns are woven into lace or painted on windows. A call for clarity and beauty in the darkest season.",
      "Aurora Vigil Night: Families gather under the night sky during midwinter, lighting lanterns shaped like stars and telling ancestral stories while watching the aurora. Celebrated to honor the spirits believed to reside in the lights, guiding the living through darkness.",
      "Thawfire Festival: A great bonfire is lit at the edge of the village using stored driftwood during the first week of spring. Ice sculptures are melted ceremoniously to mark survival of winter and welcome warmth.",
      "Silence Day: Held during the coldest stretch of winter, the entire settlement refrains from speaking from sunrise to sundown. Snow patterns are drawn with sticks for communication. Held in memory of those lost to blizzards.",
      "Moonwake: Held during the longest night of the year, dancers in white masks mimic the moon’s path through darkness while choirs hum low chants. Celebrated in reverence of the moon’s protective glow.",
      "Hearth Unseen Week: During the darkest week of winter, homes are dimly lit and food is shared with doors unbarred. No one is turned away. Celebrated to invoke protection and community."
    ]
  },
  {
    "climate": "Temperate",
    "holidays": [
      "Maplewake Day: Marked by the first sap flow of early spring, sap collectors decorate trees with red ribbons and sing songs of renewal. Celebrated as the earth begins to wake.",
      "Fielddream Festival: Celebrated over a weekend during peak spring bloom, locals nap in meadows and share dream interpretations. A tradition to connect with nature and each other’s subconscious.",
      "Rook’s Return: This one-day holiday takes place when the first rook or migratory bird is spotted in spring. Black-feathered masks are worn and tokens are left on rooftops to honor returning messengers.",
      "Willowring Day: Held in early summer, wreaths of willow are hung on doors and floated down rivers. Celebrated for healing, memory, and letting go of griefs.",
      "Stoneplow Festival: Celebrated the day before planting begins, people carve their names into stones and place them at field edges. A ritual to mark commitment to the harvest to come.",
      "Harvestlight Festival: Celebrated on the last day of harvest season, lanterns are hung in fields and people parade with wreaths of grain. Children gift baked goods to elders in thanks for the bounty.",
      "Greenrest Day: Held on the midsummer solstice, no farming or labor is done. People picnic and write wishes on leaves. Celebrated to rest both land and spirit.",
      "First Bloom Day: A late winter or early spring holiday where garlands of early flowers are exchanged and couples plant trees or gardens. Celebrated to mark new beginnings.",
      "Twilight Waltz: Celebrated during the vernal equinox, music is played in the town square at sunset while people dance in flowing robes. A symbol of balance and renewal.",
      "Wellwish Day: Held after the first spring thaw, wells are decorated with wildflowers and small offerings tossed in. Celebrated to thank freshwater spirits."
    ]
  },
  {
    "climate": "Tropical",
    "holidays": [
      "Rain's Welcome Day: Celebrated on the first rainfall after the dry season. People dance barefoot and catch raindrops in painted bowls to welcome life-giving water.",
      "Fruitfire Festival: Held during the peak of the fruiting season, carved fruit floats are sent downriver with candles, and fresh juices are shared in celebration of the year’s bounty.",
      "Coconut Day: Celebrated during late summer, coconut climbing contests and fireside storytelling fill the day. Honors the coconut as a sacred life-giver.",
      "Shellsong Week: A week-long seaside observance when wind chimes made of shells are hung. Celebrated to honor ancestors lost to the sea and seek calm waters.",
      "Sunpetal Day: During peak sunlight in early summer, marigolds and hibiscus are woven into mandalas. Celebrated to honor the tropical sun as the giver of life.",
      "Flamefruit Night: Held on the hottest night of the summer, fruits are roasted on open fires and songs are sung late into the evening. Celebrated for health, passion, and protection from illness.",
      "Mango Bloom Week: A romantic holiday during peak mango blossom season, lovers exchange poems written on mango leaves and wear fragrant garlands. Celebrated for passion and fertility.",
      "Tidekiss Day: Held on the lowest tide of the full moon cycle, sand altars are built and offerings left to the sea. Celebrated to give thanks for safe shores and bounty.",
      "Drumwake: A one-day festival held at the end of the wet season. Drums echo across the village from dawn to dusk to awaken the land and the spirits.",
      "Lizardlight Day: Celebrated during the first week of the dry season, children race lizards and release them into the wild. A call for agility, luck, and favor from jungle spirits."
    ]
  },
  {
    "climate": "Dry",
    "holidays": [
      "Sunwatch Day: Celebrated on the summer solstice, people climb rooftops or hills to watch the sunrise in complete silence. A moment of clarity, endurance, and reverence for the sun.",
      "Glassfall Week: Held over the windiest week of the dry season, colored glass shards shimmer from strings in homes and marketplaces. Celebrated to bring beauty into barren places and invite rain.",
      "Mirage Day: A one-day event during peak heat where trickster stories are told and illusions performed. Celebrated to embrace the desert’s deceptive magic.",
      "Dustfeast: A three-day trade and food festival held before the seasonal caravan departs. Dried foods are shared and traditions honored for preserving resources.",
      "Scorchstride Day: Celebrated on the hottest day of the year, people walk barefoot across sun-warmed stone paths while chanting. A ritual of strength and harmony with heat.",
      "Dust Moon: Held under the first full moon after the dry season begins, a moonlit procession releases dyed sand into the wind. Celebrated to send prayers for rain.",
      "Oasis Day: Celebrated on the hottest day of the year, wells and baths are adorned with petals and drinks are gifted to travelers. A gesture of gratitude for water.",
      "Stonebound Day: Held in early autumn, tales carved into stones are retold while children draw chalk symbols. Celebrated to preserve ancestral memory and desert resilience.",
      "Shadefast Week: During a sweltering midseason week, cloth canopies fill the streets and people walk only in shadow. Celebrated as a lesson in survival and respect for the sun.",
      "Hollow Sky Day: Echo songs are sung in canyons and caverns during the dry season’s midpoint. Celebrated to remind all that even emptiness carries memory."
    ]
  },
  {
    "climate": "Continental",
    "holidays": [
      "Stormrake Day: Observed the morning after the first spring thunderstorm, villagers gather debris and craft crowns from windfall. Celebrated as a rebirth after chaos.",
      "Flakefall Day: Takes place during the season's first snowfall. Paper birds are released into the wind to honor the peaceful arrival of winter.",
      "Longtable Night: Held on the winter solstice, the entire village eats at a single extended table regardless of the weather. Celebrated to unite the community in darkness.",
      "Verdant Pact Week: During the first full week of planting season, youths pair up to plant trees and name them. Celebrated to bond the new generation to the land.",
      "Echoleaf Day: Celebrated in late autumn when leaves begin to fall. People travel to forests or cliffs and shout dreams into the wind. A ritual to set intentions and be heard by nature.",
      "Fourfold Day: A solstice holiday where each quarter of the day represents a season, marked with themed food and music. Celebrated to honor the full cycle of the year.",
      "Crackearth Day: Celebrated on the first planting day after the frost breaks. People smash pots of seed and water before planting them. A symbol of hope and renewal.",
      "Goldenwind Week: During peak autumn, people wear golden cloaks and gather leaves into celebratory piles. Embracing the fleeting beauty of the season.",
      "Skybreaker’s Eve: Celebrated the night before the first snow, firecrackers are set off to 'break' the sky and drive away winter. A symbol of defiance and warmth.",
      "Riverwake Day: A springtime ritual held on the day the river first thaws. Small bark boats with wishes are set afloat to mark new beginnings."
    ]
  }
]